<a href="https://colab.research.google.com/github/veranika-izrailyan/python_practice/blob/main/03_Python_Pandas_DataFrames.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [4]:
import numpy as np
import pandas as pd
import datetime

## DataFrames

In [1]:
students = ['Alice', 'Bob', 'Emily', 'Charlie']

In [2]:
scores = [90, 80, 65, 50]

In [8]:
exam_results = pd.DataFrame(
    {
        "name": students,
        "marks": scores
    }
)

In [9]:
exam_results

      name  marks
0    Alice     90
1      Bob     80
2    Emily     65
3  Charlie     50

### Searching (SQL SELECT)

In [17]:
exam_results.loc[0, 'marks'] # location-> rowid, column_NAME(s)

90

In [18]:
exam_results.loc[:, 'marks']

0    90
1    80
2    65
3    50
Name: marks, dtype: int64

In [19]:
exam_results.loc[2, :]

name       Emily
marks         65
gender    female
Name: 2, dtype: object

In [20]:
exam_results['marks']

0    90
1    80
2    65
3    50
Name: marks, dtype: int64

In [21]:
exam_results[['name', 'marks']]
# on DataFrame->  filtering happens on COLUMN LEVEL

      name  marks
0    Alice     90
1      Bob     80
2    Emily     65
3  Charlie     50

### Add Columns

We can also easily add columns

In [12]:
gender = ['female', 'male', 'female', 'male']

In [13]:
exam_results['gender'] = gender
# Creates a new dataframe with a new column called Gender

In [14]:
exam_results

      name  marks  gender
0    Alice     90  female
1      Bob     80    male
2    Emily     65  female
3  Charlie     50    male

In [22]:
exam_results['marks']

0    90
1    80
2    65
3    50
Name: marks, dtype: int64

### Remove Columns

In [ ]:
exam_results.drop('name', axis=1)
# axis=1 means column wise
# axis=0 means row wise 
# 0 means index (flows through rows), 1 is for [column_names]

   scores  gender
0      90  female
1      80    male
2      65  female
3      50    male

### Column names and Row Index

In [23]:
exam_results.columns
#axis=1

Index(['name', 'marks', 'gender'], dtype='object')

In [24]:
exam_results.index
#axis=0

RangeIndex(start=0, stop=4, step=1)

### Renaming Columns

In [25]:
exam_results.rename({'name': 'first_name'}, axis=1)

  first_name  marks  gender
0      Alice     90  female
1        Bob     80    male
2      Emily     65  female
3    Charlie     50    male

### Dealing with missing values

Dataframes have specific commands which help with the handling of missing data

In [26]:
sparse = pd.DataFrame({'a': [1, 2, 3],
                       'b': [np.nan, 4, np.nan],
                       'c': [5, np.nan, np.nan]})

In [27]:
sparse

   a    b    c
0  1  NaN  5.0
1  2  4.0  NaN
2  3  NaN  NaN

In [28]:
sparse.isna()

       a      b      c
0  False   True  False
1  False  False   True
2  False   True   True

In [29]:
sparse.fillna(0) # fill those null values with 0

   a    b    c
0  1  0.0  5.0
1  2  4.0  0.0
2  3  0.0  0.0

In [30]:
sparse.dropna(axis=1) # axis=1 means column level dropping

   a
0  1
1  2
2  3

In [31]:
# sparse = pd.DataFrame({'a': [1, 2, 3],
#                        'b': [np.nan, 4, np.nan],
#                        'c': [5, np.nan, np.nan]})
# sparse.fillna(0)
sparse.dropna() # axis=0-> row wise!
# everything dropped-> each row contained at least 1 null value!

Empty DataFrame
Columns: [a, b, c]
Index: []

### Group by

In [32]:
exam_results.groupby('gender').mean()
# SQL made a lot easier!
# Select mean(*) from exam_results group by gender

        marks
gender
female   77.5
male     65.0

In [33]:
mylist = [1,2,1,2]

exam_results.groupby(mylist).get_group(1)

    name  marks  gender
0  Alice     90  female
2  Emily     65  female

In [34]:
exam_results.groupby(mylist).get_group(2)

      name  marks gender
1      Bob     80   male
3  Charlie     50   male

Thus, suppose we want to group people who obtained marks above or below 70, then we could do:

In [36]:
above_70 = exam_results['marks'] > 70
above_70

0     True
1     True
2    False
3    False
Name: marks, dtype: bool

This will compute the mean scores of students who scored above or below 70

In [37]:
exam_results.groupby(above_70).mean()

       marks
marks
False   57.5
True    85.0

### Merge and Joining

In [38]:
contacts = pd.DataFrame(
    {
        'name' : ['Alice', 'Charlie'],
        'tel'  : ['+44 1234 5678', '+44 3245 5564']
    }
)

In [39]:
exam_results.merge(contacts, left_on='name', right_on='name')   
# defaults to inner join
# inner join-> Set INTERSECTION

      name  marks  gender            tel
0    Alice     90  female  +44 1234 5678
1  Charlie     50    male  +44 3245 5564

In [40]:
exam_results.merge(contacts, left_on='name', right_on='name', how='outer')
# Null values for Bob and Emily because on outer join, no data present!
# outer join-> Set Union

      name  marks  gender            tel
0    Alice     90  female  +44 1234 5678
1      Bob     80    male            NaN
2    Emily     65  female            NaN
3  Charlie     50    male  +44 3245 5564